Repository: AJ24-7/New-folder
Catalog: gym_wale_app/lib/l10n/app_*.arb
Languages: hi

# appTitle
source: Gym-wale
hi: जिम-वाले

source: Home
hi: होम

source: Explore
hi: खोजें

source: Bookings
hi: बुकिंग

source: Favorites
hi: पसंदीदा

source: Profile
hi: प्रोफ़ाइल

source: Settings
hi: सेटिंग्स

source: Search gyms...
hi: जिम खोजें...

source: Near Me
hi: मेरे पास

source: Filters
hi: फ़िल्टर

source: Clear Filters
hi: फ़िल्टर साफ़ करें

# applyFilters
source: Apply
hi: लागू करें

source: Theme
hi: थीम

# themeLight
source: Light
hi: लाइट

# themeDark
source: Dark
hi: डार्क

# themeSystem
source: System Default
hi: सिस्टम डिफ़ॉल्ट

source: Language
hi: भाषा

# languageHindi
source: हिंदी (Hindi)
hi: हिंदी

source: General Settings
hi: सामान्य सेटिंग्स

source: Appearance
hi: दिखावट

source: Notifications
hi: सूचनाएं

source: Privacy
hi: गोपनीयता

# displaySettings
source: Display
hi: डिस्प्ले

source: Measurements
hi: माप

# notificationsEnabled
source: Enable Notifications
hi: सूचनाएं सक्षम करें

# soundEnabled
source: Sound
hi: आवाज़

# vibrationEnabled
source: Vibration
hi: कंपन

source: Auto-play Videos
hi: वीडियो ऑटो-प्ले

source: Data Saver Mode
hi: डेटा सेवर मोड

source: Share Workout Data
hi: वर्कआउट डेटा शेयर करें

source: Share Progress
hi: प्रगति शेयर करें

source: Profile Visibility
hi: प्रोफ़ाइल दृश्यता

# profilePublic
source: Public
hi: सार्वजनिक

# profileFriends
source: Friends Only
hi: केवल मित्र

# profilePrivate
source: Private
hi: निजी

source: Font Size
hi: फ़ॉन्ट साइज़

source: Show Animations
hi: एनिमेशन दिखाएं

source: Workout Assistant
hi: वर्कआउट सहायक

source: Workout Assistant
hi: वर्कआउट सहायक

source: Workout Plans
hi: वर्कआउट प्लान्स

source: Personalized Workouts
hi: व्यक्तिगत वर्कआउट

source: Calculate BMI
hi: बीएमआई गणना करें

source: Your BMI
hi: आपका बीएमआई

source: BMI Category
hi: बीएमआई श्रेणी

source: Underweight
hi: कम वज़न

source: Normal Weight
hi: सामान्य वज़न

source: Overweight
hi: अधिक वज़न

source: Obese
hi: मोटापा

source: Fitness Level
hi: फिटनेस स्तर

source: Beginner
hi: शुरुआती

source: Intermediate
hi: मध्यम

source: Advanced
hi: उन्नत

source: Recommended Plans
hi: अनुशंसित योजनाएं

source: All Plans
hi: सभी योजनाएं

source: My Progress
hi: मेरी प्रगति

source: Workout Schedule
hi: वर्कआउट शेड्यूल

source: Exercises
hi: व्यायाम

source: Exercise Details
hi: व्यायाम विवरण

source: Instructions
hi: निर्देश

source: Pro Tips
hi: प्रो टिप्स

source: Sets
hi: सेट्स

source: Reps
hi: रेप्स

source: Duration
hi: अवधि

source: Rest Time
hi: आराम का समय

source: Equipment
hi: उपकरण

source: Muscle Group
hi: मांसपेशी समूह

source: Difficulty
hi: कठिनाई

# start_plan
source: Start This Plan
hi: यह योजना शुरू करें

# mark_complete
source: Mark as Complete
hi: पूर्ण के रूप में चिह्नित करें

source: Exercise Completed
hi: व्यायाम पूर्ण

source: Weight (kg)
hi: वजन (किलो)

source: Height (cm)
hi: ऊंचाई (सेमी)

source: Weekly Schedule
hi: साप्ताहिक शेड्यूल

# no_active_plan
source: No Active Workout Plan
hi: कोई सक्रिय वर्कआउट योजना नहीं

# explore_workouts
source: Explore Workout Plans
hi: वर्कआउट योजनाएं देखें

source: Measurement System
hi: माप प्रणाली

# metric
source: Metric (kg, km)
hi: मीट्रिक (kg, km)

# imperial
source: Imperial (lbs, miles)
hi: इम्पीरियल (lbs, miles)

source: Save
hi: सेव करें

source: Cancel
hi: रद्द करें

source: Done
hi: हो गया

source: OK
hi: ठीक है

# settingsSaved
source: Settings saved successfully
hi: सेटिंग्स सफलतापूर्वक सेव हो गई

source: Error
hi: त्रुटि

source: Try again
hi: पुनः प्रयास करें

source: Find Your Perfect Gym
hi: अपना परफेक्ट जिम खोजें

source: Popular Gyms
hi: लोकप्रिय जिम

# topRatedGyms
source: Top rated gyms in your area
hi: आपके क्षेत्र के टॉप रेटेड जिम

source: See All
hi: सभी देखें

source: Quick Actions
hi: त्वरित कार्य

source: Find Gyms
hi: जिम खोजें

source: Book Trial
hi: ट्रायल बुक करें

source: Diet Plans
hi: डाइट प्लान

source: Find Trainer
hi: ट्रेनर खोजें

source: Trainer Spotlight
hi: ट्रेनर स्पॉटलाइट

# topTrainers
source: Top trainers for you
hi: आपके लिए शीर्ष ट्रेनर

source: Special Offers
hi: विशेष ऑफर

# exclusiveDeals
source: Exclusive deals and discounts
hi: विशेष सौदे और छूट

source: No gyms found
hi: कोई जिम नहीं मिला

# tryAdjustingSearch
source: Try adjusting your search
hi: अपनी खोज को समायोजित करने का प्रयास करें

source: Highest Rated
hi: सर्वोच्च रेटेड

source: Nearest
hi: निकटतम

source: Name (A-Z)
hi: नाम (A-Z)

source: All
hi: सभी

source: Rating
hi: रेटिंग

source: Distance
hi: दूरी

source: Name
hi: नाम

source: Choose Theme
hi: थीम चुनें

source: Choose Language
hi: भाषा चुनें

source: Theme updated successfully
hi: थीम सफलतापूर्वक अपडेट हो गई

source: Language updated successfully
hi: भाषा सफलतापूर्वक अपडेट हो गई

# measurementSystemUpdated
source: Measurement system updated successfully
hi: माप प्रणाली सफलतापूर्वक अपडेट हो गई

source: Light
hi: लाइट

source: Dark
hi: डार्क

source: System Default
hi: सिस्टम डिफ़ॉल्ट

# hindi
source: हिंदी (Hindi)
hi: हिंदी

source: Choose Measurement System
hi: माप प्रणाली चुनें

source: My Bookings
hi: मेरी बुकिंग

source: My Favorites
hi: मेरे पसंदीदा

source: Active
hi: सक्रिय

source: Expired
hi: समाप्त

source: Cancelled
hi: रद्द

source: Trials
hi: ट्रायल

source: No bookings found
hi: कोई बुकिंग नहीं मिली

# startFitnessJourney
source: Start your fitness journey now
hi: अपनी फिटनेस यात्रा अभी शुरू करें

source: No favorites yet
hi: अभी तक कोई पसंदीदा नहीं

# saveFavoriteGyms
source: Save your favorite gyms here
hi: अपने पसंदीदा जिम यहां सेव करें

source: Mark all read
hi: सभी को पढ़ा हुआ मार्क करें

source: No notifications
hi: कोई सूचना नहीं

# youAreAllCaughtUp
source: You're all caught up!
hi: आप पूरी तरह अपडेट हैं!

source: Unread
hi: अपठित

source: Offer
hi: ऑफर

source: Membership
hi: सदस्यता

source: Trial
hi: ट्रायल

source: Today
hi: आज

source: Yesterday
hi: कल

source: This Week
hi: इस सप्ताह

source: Earlier
hi: पहले

source: Subscriptions
hi: सदस्यताएं

source: Gym Memberships
hi: जिम सदस्यताएं

source: Upcoming Trials
hi: आने वाले ट्रायल

source: Trainers
hi: ट्रेनर

source: Workout Plans
hi: वर्कआउट प्लान

source: No Active Memberships
hi: कोई सक्रिय सदस्यता नहीं

# startFitnessJourneyToday
source: Start your fitness journey today!
hi: आज ही अपनी फिटनेस यात्रा शुरू करें!

source: No Diet Plans
hi: कोई डाइट प्लान नहीं

# subscribeDietPlan
source: Subscribe to a diet plan for better nutrition!
hi: बेहतर पोषण के लिए डाइट प्लान की सदस्यता लें!

source: No Upcoming Trials
hi: कोई आगामी ट्रायल नहीं

# bookTrialFromGym
source: Book a trial session from gym details
hi: जिम विवरण से ट्रायल सत्र बुक करें

source: No Trainers Booked
hi: कोई ट्रेनर बुक नहीं

# getPersonalizedTraining
source: Get personalized training with expert trainers!
hi: विशेषज्ञ ट्रेनरों के साथ व्यक्तिगत प्रशिक्षण प्राप्त करें!

source: Show Details
hi: विवरण दिखाएं

source: Freeze
hi: फ्रीज़

source: Freeze Used
hi: फ्रीज़ उपयोग किया

source: Start Date
hi: आरंभ तिथि

source: End Date
hi: समाप्ति तिथि

source: Membership frozen until
hi: सदस्यता फ्रीज़ रहेगी

# expiringMessage
source: Your membership is expiring soon. Contact gym to renew!
hi: आपकी सदस्यता जल्द समाप्त हो रही है। नवीनीकरण के लिए जिम से संपर्क करें!

source: Freeze Membership
hi: सदस्यता फ्रीज़ करें

# freezeYourMembership
source: Freeze your membership temporarily. Your membership will be extended by the freeze duration.
hi: अपनी सदस्यता अस्थायी रूप से फ्रीज़ करें। आपकी सदस्यता फ्रीज़ अवधि के बराबर बढ़ा दी जाएगी।

source: Freeze Criteria:
hi: फ्रीज़ मानदंड:

# freezeDuration715
source: • Duration: 7-15 days only
hi: • अवधि: केवल 7-15 दिन

# freezeOncePerMembership
source: • Can freeze only once per membership
hi: • प्रति सदस्यता केवल एक बार फ्रीज़ कर सकते हैं

# validityExtendsAuto
source: • Validity extends automatically
hi: • वैधता स्वचालित रूप से बढ़ती है

source: Freeze Duration
hi: फ्रीज़ अवधि

source: days
hi: दिन

# membershipExtendedBy
source: Your membership will be extended by
hi: आपकी सदस्यता बढ़ा दी जाएगी

source: Reason (optional)
hi: कारण (वैकल्पिक)

# reasonPlaceholder
source: e.g., Vacation, Medical, etc.
hi: जैसे, छुट्टी, चिकित्सा, आदि

# membershipFrozenSuccess
source: Membership frozen successfully!
hi: सदस्यता सफलतापूर्वक फ्रीज़ हो गई!

# failedToFreeze
source: Failed to freeze membership
hi: सदस्यता फ्रीज़ करने में विफल

# reminderSet
source: Reminder set for
hi: रिमाइंडर सेट किया गया

source: trial on
hi: ट्रायल

source: View Diet Plan
hi: डाइट प्लान देखें

source: Renew Plan
hi: प्लान नवीनीकरण करें

source: Confirmed
hi: पुष्टि की गई

source: Pending
hi: लंबित

source: Set Reminder
hi: रिमाइंडर सेट करें

source: Get Directions
hi: दिशा-निर्देश पाएं

# pendingConfirmation
source: Awaiting gym confirmation. You'll be notified once confirmed.
hi: जिम की पुष्टि की प्रतीक्षा में। पुष्टि होने पर आपको सूचित किया जाएगा।

source: Message
hi: संदेश

source: View Profile
hi: प्रोफ़ाइल देखें

source: Session Type
hi: सत्र प्रकार

source: Sessions Booked
hi: सत्र बुक किए

source: Experience
hi: अनुभव

# calories
source: cal
hi: कैलोरी

# protein
source: P
hi: प्रो

# carbs
source: C
hi: कार्ब

# fats
source: F
hi: फैट

source: Membership Pass
hi: सदस्यता पास

source: Member ID
hi: सदस्य ID

source: Valid Until
hi: वैध तक

source: Plan Name
hi: प्लान नाम

source: Amount
hi: राशि

source: Scan QR Code
hi: QR कोड स्कैन करें

# scanThisCode
source: Scan this code at gym entrance for attendance
hi: उपस्थिति के लिए जिम प्रवेश पर इस कोड को स्कैन करें
